---
kind: method
id: M:Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.Dispose
source: html/b5b2d130-5f4a-1e04-a6b9-5f2add0eb510.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.Dispose Method

Releases all resources used by the FabricationPartSizeMap

## Syntax (C#)
```csharp
public void Dispose()
```